Goal_App/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "jon"], ["password_digest", "$2a$12$iqYlm3.d8pH3OiZGq1/mkeqoxV8fDu8r40gJrqJVWos3pqdFRy/Qm"], ["created_at", "2021-09-22 21:07:00.611077"], ["updated_at", "2021-09-22 21:07:00.611077"]]
---
    def create
        @user = User.new(user_params)
        if @user.save